app/views/store/index.html.erb

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT 1
---

<% cache ['store', Product.last] do %>